"""
Подвиг 3. На вход программы подается вещественное число. Необходимо импортировать только одну функцию floor из модуля math, вызывать ее для введенного числа и отобразить результат на экране.
"""

from math import floor

print(floor(float(input())))
