"""
Подвиг 6. На вход программы подается целое десятичное число.
Используя битовые операции, выполните целочисленное деление введенного числа на 2.
Результат отобразите на экране.
"""

print(int(input()) >> 1)
